# 2. Создайте программу для игры с конфетами человек против человека.

# Правила: На столе лежит 150 конфет. Играют два игрока делая ход друг после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# 1. Добавьте игру против бота
# 2. Подумайте как наделить бота 'интеллектом'
# Оба задания обязательны

import tkinter as tk
mainWindow = tk.Tk()
photo = tk.PhotoImage(file='Seminar5HomeWork\IcoGame.png')
mainWindow.iconphoto(False, photo)
mainWindow.title('Игра с конфетами')
mainWindow.geometry("500x600+300+100")
mainWindow.resizable(False, False)
mainWindow.mainloop()
